app/controllers/api/v1/celestials_controller.rb

  def index
    render json: {
      celestials: Celestial.all,
      current_user: user_signed_in?
---
SELECT "celestials".* FROM "celestials"